import { Text, View, SafeAreaView, Image, Button } from "react-native";
import React from "react";
import { styles } from "./style.js";

const Pro2 = ({ navigation }) => {
  return (
    <View style={styles.container}>
      <View style={styles.imageStack}>
        <Image
          source={require("../assets/img2.png")}
          resizeMode="contain"
          style={styles.image}
        />
        <Text style={styles.Text}>
          เลขบัตรประชาชน 2285937384169{"\n"}นาย C D{"\n"}
          สัญญาเพิ่มเติมการประกันสุขภาพแบบ อีลิท เฮลท์ Elite Health แผน4
          (100,000,000){"\n"}บริษัท เมืองไทยประกันชีวิต จํากัด (มหาชน)
        </Text>
      </View>
      <Text style={styles.Head}>สิทธิประโยชน์ที่ได้รับ</Text>
      <View style={styles.Detail}>
        <Text style={styles.TextC}>
          1. ผลประโยชน์กรณีที่ผู้เอาประกันภัย เข้ารับการรักษาเป็นผู้ป่วยในของ
          โรงพยาบาล {"\n"}
          {"\t"}• ค่าห้อง ค่าอาหาร ค่าบริการพยาบาลประจําวัน ต่อวัน ต่อการเข้าพัก
          รักษาตัวครั้งใดครั้งหนึ่ง (สูงสุดไม่เกิน 365 วัน) ค่าห้องผู้ป่วยวิกฤต
          (สูงสุดไม่เกิน 365 วัน) โดยเมื่อรวมผลประโยชน์ค่า ห้องค่าอาหาร
          ค่าบริการพยาบาลประจําวันแล้วไม่เกิน 365 วัน {"\n"}
          {"\t"}• ค่ารักษาพยาบาลอื่นๆ ในโรงพยาบาล{"\n"}
          {"\t"} • ค่าแพทย์ตรวจรักษาในโรงพยาบาลประจําวันและคําปรึกษาแพทย์
          ผู้เชี่ยวชาญ {"\n"}
          {"\t"}• ค่าแพทย์ผ่าตัดและหัตถการ • ค่าธรรมเนียมวิสัญญีแพทย์ และ/หรือ
          วิสัญญีพยาบาล ค่าผ่าตัดและอุปกรณ์ในห้องผ่าตัด {"\n"}
          {"\t"}• ค่าใช้จ่ายสําหรับการปลูกถ่ายอวัยวะ (สูงสุด 1 ครั้ง ตลอดชีวิต)
          ค่าห้องพักในโรงพยาบาลสําหรับบิดาหรือมารดา (เตียงเสริม) ต่อวัน{"\n"}
          {"\t"} • ค่าฟื้นฟูสภาพในฐานะผู้ป่วนใน{"\n"}
          {"\t"}• ค่ารักษาทางจิตเวชในฐานะผู้ป่วยใน{"\n"}
          2. ผลประโยชน์การรักษาพยาบาลแบบฉุกเฉิน {"\n"}
          {"\t"}• ค่าธรรมเนียมรถพยาบาล {"\n"}
          {"\t"}• ค่ารักษาทางทันตกรรมเนื่องจากการบาดเจ็บจากอุบัติเหตุ{"\n"}
          {"\t"}• ค่ารักษาพยาบาลเนื่องจากอุบัติเหตุภายใน 24 ชม.
          ขณะเป็นผู้ป่วยนอก {"\n"}
          {"\t"}• ค่าบริการช่วยเหลือฉุกเฉินทางการแพทย์{"\n"}
          3. ผลประโยชน์ค่ารักษาพยาบาลผู้ป่วยนอก
          {"\t"}• ค่าธรรมเนียนปรึกษาแพทย์เวชปฏิบัติทั่วไปและแพทย์เฉพาะทาง รวม
          ไปถึงค่าวินิจฉัยและค่ายา {"\n"}
          {"\t"}• การฝังเข็ม ธรรมชาติบําบัด กระดูกและกล้ามเนื้อบําบัด และการจัด
          กระดูก สูงสุดต่อปีกรมธรรม์ไม่เกิน ค่ากายภาพบําบัด{"\n"}
          {"\t"}• ค่าภาพวินิจฉัยขั้นสูง
          เช่นการตรวจเอ็กซ์เรย์ด้วยคลื่นแม่เหล็กไฟฟ้า (MRI) {"\n"}
          {"\t"}• ค่ารักษาโรคมะเร็ง รวมถึงเคมีบําบัด การรักษาแบบออกฤทธิ์จําเพาะ
          เจาะจงต่อเซลล์มะเร็ง (Targeted Therapy) และรังสีบําบัด {"\n"}
          {"\t"}• ค่าล้างไต{"\n"}
          {"\t"}• ค่าบริการช่วยเหลือฉุกเฉินทางการแพทย์{"\n"}
          4. ผลประโยชน์การคลอดบุตร {"\n"}
          {"\t"}• ค่าใช้จ่ายการคลอดบุตร {"\n"}
          {"\t"}•ค่าใช้จ่ายสําหรับการถ่างขยายปากมดลูกและการขูดมดลูกกรณีแท้งบุตร
          {"\n"}
          {"\t"}• ค่าใช้จ่ายกรณีเกิดภาวะแทรกซ้อนขณะตั้งครรภ์และหลังคลอดบุตร
          {"\n"}
          5. ผลประโยชน์รักษาพยาบาลอื่นๆ
        </Text>
      </View>
      <Button
        title="กลับ"
        onPress={() => navigation.navigate("Home")}
        color="#48ccc4"
      />
    </View>
  );
};

export default Pro2;
